## Basic Python Coding - Revision
### Sulaiman Binkhamis
### April 12, 2023

#### Dictionary

In [1]:
# create a dictionary to map country and capital city

dict = {'KSA':'Riyadh','USA':'Washington'}
dict

{'KSA': 'Riyadh', 'USA': 'Washington'}

In [2]:
dict.keys()

dict_keys(['KSA', 'USA'])

In [3]:
dict.values()

dict_values(['Riyadh', 'Washington'])

#### List

In [4]:
list = [23,56,68,33,13,17]
list

[23, 56, 68, 33, 13, 17]

In [5]:
# extract even numbers from the list using for loop

l=[]
for item in list:
    if item % 2 == 0:
        l.append(item)
print("Even numbers from the list are: ",l)

Even numbers from the list are:  [56, 68]

In [6]:
# extract even numbers from the list using list comprehension

l2 =[item for item in list if item % 2 == 0]
print("Even numbers from the list are: ",l2)

Even numbers from the list are:  [56, 68]

#### Map function

In [7]:
import math

def sqrt(x):
    return math.sqrt(x)

values = [4,9,16]

values_sqrt = map(sqrt, values)
for values in values_sqrt:
    print(values)

2.0
3.0
4.0

#### Tuples & Lambda Function

In [8]:
# Extract values that are divisible by 3 from a tuple

tuple1 = (3,-3,5,9,2)

divisible_by_3_tuple= tuple(filter(lambda x: (x % 3 == 0), tuple1))

print(divisible_by_3_tuple)

(3, -3, 9)

#### Dictionary to DataFrame

In [9]:
# Create a dataframe from dicitionary

import pandas as pd

Students = {'Name':['David','Fahad','Ali','Sulaiman'], 'Age':[10,11,10.5,9.5], 'Grade':['A','C','A','B']}
print(Students)

{'Name': ['David', 'Fahad', 'Ali', 'Sulaiman'], 'Age': [10, 11, 10.5, 9.5], 'Grade': ['A', 'C', 'A', 'B']}

In [10]:
df = pd.DataFrame(Students)

In [11]:
df

       Name   Age Grade
0     David  10.0     A
1     Fahad  11.0     C
2       Ali  10.5     A
3  Sulaiman   9.5     B

#### Summary Statistics

In [12]:
# Summary Statistics of a dataframe

df.describe()

             Age
count   4.000000
mean   10.250000
std     0.645497
min     9.500000
25%     9.875000
50%    10.250000
75%    10.625000
max    11.000000

#### Access specific rows and columns of a dataframe using loc() and iloc()

In [13]:
# loc() - to access specific rows and columns

df.loc[2:3]

       Name   Age Grade
2       Ali  10.5     A
3  Sulaiman   9.5     B

In [14]:
df.loc[2:3,['Name','Grade']]

       Name Grade
2       Ali     A
3  Sulaiman     B

In [15]:
# iloc() - to access specific rows and columns using index number

df.iloc[2:4,0:3]

       Name   Age Grade
2       Ali  10.5     A
3  Sulaiman   9.5     B

In [16]:
# access specific rows and columns using some conditions

print(df.loc[df['Age']>=10,['Name','Grade']])

    Name Grade
0  David     A
1  Fahad     C
2    Ali     A

#### List append and List extend

In [17]:
# list.append vs list.extend

# list.append

list1 = ['Sulaiman', 'Fahad', 'Ali']
list2 = ['Messi', 'Ronaldo']

list1.append(list2)
list1

['Sulaiman', 'Fahad', 'Ali', ['Messi', 'Ronaldo']]

In [18]:
# list.extend

list1 = ['Sulaiman', 'Fahad', 'Ali']
list2 = ['Messi', 'Ronaldo']

list1.extend(list2)
list1

['Sulaiman', 'Fahad', 'Ali', 'Messi', 'Ronaldo']

#### Create a new column in a dataframe based on some conditions

In [19]:
# Create new column in a dataframe based on conditions

fun = lambda x: 'Excellent' if x == 'A' else 'Good'
df['Grade_Text'] = df.Grade.apply(fun)
df

       Name   Age Grade Grade_Text
0     David  10.0     A  Excellent
1     Fahad  11.0     C       Good
2       Ali  10.5     A  Excellent
3  Sulaiman   9.5     B       Good

#### Create a matrix and calculate Trace

In [20]:
# Create a 5x5 matrix

import numpy as np

matrix = np.array([[1,2,3,4,5],
                 [6,7,8,9,10],
                 [11,12,13,14,15],
                 [16,17,18,19,20],
                  [21,22,23,24,25]])
matrix

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])

In [21]:
# Diagonal elements of a matrix

matrix.diagonal()

array([ 1,  7, 13, 19, 25])

In [22]:
# Calculate Trace of a matrix

matrix.diagonal().sum()

65